print(int(2.5))  #ответ автоматически преобразуется в число с плауещей точкой типа int
print(int(2.5/2))   #При преобразовании числа с плавующей точкой дробная часть откидывается
#округляется всегда в меньшую сторону
print(int(5/2)) #Дробная чать ответа откидывается округляется
#округляетя всегда в меньшую строну, ответ остается типа int
print(2.5/2)  #ответ автоматически преобразуется в число с плауещей точкой типа float
print(5/2)  #ответ автоматически преобразуется в число с плауещей точкой типа float
print(float(2))  #ответ автоматически преобразуется в число с плауещей точкой типа float
print(float(5/2))   #ответ остается типа float
print(float(2.5/2)) #Дробная часть сохраняется, ответ остается типа float, дробная часть сохраняется