# # Создание и вывод на экран списка
# print('Привет, я Анфиса!')
# # допишите код ниже
friends = ['Сергей', 'Соня', 'Дима', 'Алина', 'Егор']
print(friends)


# # Обращение по индексу в списке
# friends = ['Сергей', 'Соня', 'Дима', 'Алина', 'Егор']
#
# # присвойте переменной index такое значение,
# # чтобы из списка friends была выбрана Алина
# #index = 3
#
# print('Привет, ' + friends[3]+ ', я Анфиса!')    # либо friends[index]

# Длина или количество элементов в списке
print("Привет, я Анфиса!")
friends = ['Сергей', 'Соня', 'Дима', 'Алина', 'Егор']

# допишите свой код сюда
count = len(friends)
print(f"У тебя {count} друзей")

# Удаление элементов списка
del friends[-1]
print(friends)
